<a href="https://colab.research.google.com/github/Fabriciome/data-manipulation-exercises/blob/master/Resolu%C3%A7%C3%A3o_de_Exercicios_unidade_5_Manipulacao_de_Dados_Parte_03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 3

Neste Jupyter notebook você irá resolver uma exercícios utilizando a biblioteca Pandas.\
Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.\
Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

#### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/users_dataset.txt***.\
Salve os dados em uma variável de nome *users*.

In [124]:
import pandas as pd
import numpy as np
users = pd.read_csv('/content/users_dataset.csv',sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

#### Tarefa 2. Descubra qual a idade média por ocupação.

*Dica: use a função groupby do Pandas na coluna occupation*

In [125]:
sem_id=users.drop('user_id',axis=1)
sem_id.groupby('occupation').mean()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

#### Tarefa 3. Para cada ocupação descubra a idade mínima e máxima.

In [126]:
novo = users.drop(columns=['gender','user_id','zip_code'])
min = novo.groupby('occupation').min()
max = novo.groupby('occupation').max()
merged_df=min.merge(max,on="occupation",suffixes=('(min.)', '(max.)'))
merged_df

               age(min.)  age(max.)
occupation
administrator         21         70
artist                19         48
doctor                28         64
educator              23         63
engineer              22         70
entertainment         15         50
executive             22         69
healthcare            22         62
homemaker             20         50
lawyer                21         53
librarian             23         69
marketing             24         55
none                  11         55
other                 13         64
programmer            20         63
retired               51         73
salesman              18         66
scientist             23         55
student                7         42
technician            21         55
writer                18         60

#### Tarefa 4. Para cada combinação de ocupação e sexo, calcule a idade média.

Exemplo:

```
occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
```

In [127]:
round(users.groupby(['occupation','gender'])['age'].mean(),0)

occupation     gender
administrator  F         41.0
               M         37.0
artist         F         30.0
               M         32.0
doctor         M         44.0
educator       F         39.0
               M         43.0
engineer       F         30.0
               M         37.0
entertainment  F         31.0
               M         29.0
executive      F         44.0
               M         38.0
healthcare     F         40.0
               M         45.0
homemaker      F         34.0
               M         23.0
lawyer         F         40.0
               M         36.0
librarian      F         40.0
               M         40.0
marketing      F         37.0
               M         38.0
none           F         36.0
               M         19.0
other          F         35.0
               M         34.0
programmer     F         32.0
               M         33.0
retired        F         70.0
               M         63.0
salesman       F         27.0
               M         39.0
scientist      F         28.0
               M         36.0
student        F         21.0
               M         23.0
technician     F         38.0
               M         33.0
writer         F         38.0
               M         35.0
Name: age, dtype: float64

#### Tarefa 5. Para cada ocupação calcule a porcentagem de homens e mulheres.

Exemplo:

```
occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
```

In [129]:
users.drop(columns=['age','user_id','zip_code'])
novo = users.groupby(['occupation','gender']).size()
total_occup = users.groupby('occupation').size()
percM = (novo/total_occup)*100
round(percM,0)

occupation     gender
administrator  F          46.0
               M          54.0
artist         F          46.0
               M          54.0
doctor         M         100.0
educator       F          27.0
               M          73.0
engineer       F           3.0
               M          97.0
entertainment  F          11.0
               M          89.0
executive      F           9.0
               M          91.0
healthcare     F          69.0
               M          31.0
homemaker      F          86.0
               M          14.0
lawyer         F          17.0
               M          83.0
librarian      F          57.0
               M          43.0
marketing      F          38.0
               M          62.0
none           F          44.0
               M          56.0
other          F          34.0
               M          66.0
programmer     F           9.0
               M          91.0
retired        F           7.0
               M          93.0
salesman       F          25.0
               M          75.0
scientist      F          10.0
               M          90.0
student        F          31.0
               M          69.0
technician     F           4.0
               M          96.0
writer         F          42.0
               M          58.0
dtype: float64

**Parabéns! Você chegou ao fim!**